{
    "Begin Dialog": {
        "documentation": "Start the definition of a Dialog Box control"
    },
    "ByRef": {
        "documentation": "Gives other subroutines and functions the permission to make changes to variables that are passed in as parameters."
    },
    "ByVal": {
        "documentation": "Denies this permission to make changes to variables that are passed in the parameters, so they cannot be reassigned outside their local procedure."
    },
    "Call": {
        "documentation": "Transfers control to a Sub procedure or Function procedure"
    },
    "CancelButton": {
        "documentation": "Defines a button for a dialog, for closing the dialog box"
    },
    "Const": {
        "documentation": "Assigns a symbolic name to a constant value."
    },
    "Dim": {
        "documentation": "Allocates storage for and declares the data type of variables and arrays in a module. "
    },
    "Do": {
        "documentation": "Repeats a group of  statements while a condition is true or until a condition is met."
    },
    "Each": {
        "documentation": ""
    },
    "Else": {
        "documentation": "This instruction should be used if a statement block is to be executed if the condition does not apply."
    },
    "End": {
        "documentation": "Ends a program or a block of statements such as a Sub procedure, function or a Dialog Box control."
    },
    "End Dialog": {
        "documentation": "Ends the definition of a Dialog Box control"
    },
    "Erase": {
        "documentation": "Reinitializes the elements of a fixed array."
    },
    "Exit": {
        "documentation": "Exits a loop or procedure."
    },
    "For": {
        "documentation": "Repeats a group of instructions."
    },
    "Function": {
        "documentation": ""
    },
    "GoSub": {
        "documentation": "Branches to a subroutine within a procedure."
    },
    "GoTo": {
        "documentation": "Branches unconditionally and without return to a specified label in a procedure."
    },
    "Global": {
        "documentation": ""
    },
    "If": {
        "documentation": ""
    },
    "In": {
        "documentation": ""
    },
    "Loop": {
        "documentation": ""
    },
    "Line Input": {
        "documentation": "Reads a line from a sequential file into a String or Variant variable."
    },
    "Next": {
        "documentation": ""
    },
    "OKButton": {
        "documentation": "Defines a button for a dialog, for selecting options and closing dialog boxes"
    },
    "Option Explicit": {
        "documentation": "Used at script level to force explicit declaration of all variables in that script."
    },
    "Option Base 1": {
        "documentation": "Changes the default lower bound for arrays to 1."
    },
    "On Error Resume Next": {
        "documentation": "Specifies that when a run-time error occurs, control goes to the statement immediately following the statement where the error occurred and execution continues"
    },
    "On Error GoTo 0": {
        "documentation": "Disables any enabled error handler in the current procedure."
    },
    "Optional": {
        "documentation": ""
    },
    "Private": {
        "documentation": ""
    },
    "Randomize": {
        "documentation": "Initializes the random-number generator."
    },
    "ReDim": {
        "documentation": "Used at the procedure level to reallocate storage space for dynamic array variables."
    },
    "Rem": {
        "documentation": "Used to include explanatory remarks in a program."
    },
    "Return": {
        "documentation": "Returns from a subroutine within a procedure."
    },
    "Seek": {
        "documentation": "Sets the position in a file for the next read or write"
    },
    "Select Case": {
        "documentation": "Executes one of the statement blocks in the 'case' based on the test variable."
    },
    "Set": {
        "documentation": "Assigns an object to an object variable."
    },
    "Static": {
        "documentation": "Used to declare static variables and allocate storage space. These variables will retain their value through the program run."
    },
    "Stop": {
        "documentation": "Ends execution of the program."
    },
    "Step": {
        "documentation": "Amount counter is changed each time through the loop. If not specified, step defaults to one."
    },
    "Sub": {
        "documentation": ""
    },
    "Then": {
        "documentation": ""
    },
    "To": {
        "documentation": ""
    },
    "Type": {
        "documentation": "Defines a user-defined data type (UDT) containing one or more elements."
    },
    "Text": {
        "documentation": "Creates a text field for titles and labels in Dialog Box controls"
    },
    "Until": {
        "documentation": ""
    },
    "Wend": {
        "documentation": ""
    },
    "While": {
        "documentation": ""
    },
    "With": {
        "documentation": "The With statement allows you to proform a series of commands or statements on a particular object without again refering to the name of that object."
    }
}
